tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1509_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1509_H_
#define _PIC16LF1509_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define SSP1IF                        59
#define TXIF                          60
#define RCIF                          61
#define ADIF                          62
#define TMR1GIF                       63
#define PIR2                          64
#define NCO1IF                        65
#define BCL1IF                        66
#define C1IF                          67
#define C2IF                          68
#define OSFIF                         69
#define PIR3                          70
#define CLC1IF                        71
#define CLC2IF                        72
#define CLC3IF                        73
#define CLC4IF                        74
#define TMR0                          75
#define TMR1L                         76
#define TMR1H                         77
#define T1CON                         78
#define TMR1ON                        79
#define nT1SYNC                       80
#define T1OSCEN                       81
#define T1CKPS0                       82
#define T1CKPS                        83
#define T1CKPS1                       84
#define TMR1CS0                       85
#define TMR1CS                        86
#define TMR1CS1                       87
#define T1GCON                        88
#define T1GSS0                        89
#define T1GSS                         90
#define T1GSS1                        91
#define T1GVAL                        92
#define T1GGO_nDONE                   93
#define T1GSPM                        94
#define T1GTM                         95
#define T1GPOL                        96
#define TMR1GE                        97
#define TMR2                          98
#define PR2                           99
#define T2CON                         100
#define T2CKPS0                       101
#define T2CKPS                        102
#define T2CKPS1                       103
#define TMR2ON                        104
#define T2OUTPS0                      105
#define T2OUTPS                       106
#define T2OUTPS1                      107
#define T2OUTPS2                      108
#define T2OUTPS3                      109
#define TRISA                         110
#define TRISA0                        111
#define TRISA1                        112
#define TRISA2                        113
#define TRISA3                        114
#define TRISA4                        115
#define TRISA5                        116
#define TRISB                         117
#define TRISB4                        118
#define TRISB5                        119
#define TRISB6                        120
#define TRISB7                        121
#define TRISC                         122
#define TRISC0                        123
#define TRISC1                        124
#define TRISC2                        125
#define TRISC3                        126
#define TRISC4                        127
#define TRISC5                        128
#define TRISC6                        129
#define TRISC7                        130
#define PIE1                          131
#define TMR1IE                        132
#define TMR2IE                        133
#define SSP1IE                        134
#define TXIE                          135
#define RCIE                          136
#define ADIE                          137
#define TMR1GIE                       138
#define PIE2                          139
#define NCO1IE                        140
#define BCL1IE                        141
#define C1IE                          142
#define C2IE                          143
#define OSFIE                         144
#define PIE3                          145
#define CLC1IE                        146
#define CLC2IE                        147
#define CLC3IE                        148
#define CLC4IE                        149
#define OPTION_REG                    150
#define PS                            151
#define PS0                           152
#define PS1                           153
#define PS2                           154
#define PSA                           155
#define T0SE                          156
#define TMR0SE                        157
#define T0CS                          158
#define TMR0CS                        159
#define INTEDG                        160
#define nWPUEN                        161
#define PCON                          162
#define nBOR                          163
#define nPOR                          164
#define nRI                           165
#define nRMCLR                        166
#define nRWDT                         167
#define STKUNF                        168
#define STKOVF                        169
#define WDTCON                        170
#define SWDTEN                        171
#define WDTPS                         172
#define WDTPS0                        173
#define WDTPS1                        174
#define WDTPS2                        175
#define WDTPS3                        176
#define WDTPS4                        177
#define OSCCON                        178
#define SCS0                          179
#define SCS                           180
#define SCS1                          181
#define IRCF                          182
#define IRCF0                         183
#define IRCF1                         184
#define IRCF2                         185
#define IRCF3                         186
#define OSCSTAT                       187
#define HFIOFS                        188
#define LFIOFR                        189
#define HFIOFR                        190
#define OSTS                          191
#define SOSCR                         192
#define ADRESL                        193
#define ADRESH                        194
#define ADCON0                        195
#define ADON                          196
#define GO_nDONE                      197
#define GO                            198
#define ADGO                          199
#define CHS0                          200
#define CHS                           201
#define CHS1                          202
#define CHS2                          203
#define CHS3                          204
#define CHS4                          205
#define ADCON1                        206
#define ADPREF                        207
#define ADPREF0                       208
#define ADPREF1                       209
#define ADCS                          210
#define ADFM                          211
#define ADCON2                        212
#define TRIGSEL                       213
#define TRIGSEL0                      214
#define TRIGSEL1                      215
#define TRIGSEL2                      216
#define TRIGSEL3                      217
#define LATA                          218
#define LATA0                         219
#define LATA1                         220
#define LATA2                         221
#define LATA4                         222
#define LATA5                         223
#define LATB                          224
#define LATB4                         225
#define LATB5                         226
#define LATB6                         227
#define LATB7                         228
#define LATC                          229
#define LATC0                         230
#define LATC1                         231
#define LATC2                         232
#define LATC3                         233
#define LATC4                         234
#define LATC5                         235
#define LATC6                         236
#define LATC7                         237
#define CM1CON0                       238
#define C1SYNC                        239
#define C1HYS                         240
#define C1SP                          241
#define C1POL                         242
#define C1OE                          243
#define C1OUT                         244
#define C1ON                          245
#define CM1CON1                       246
#define C1NCH0                        247
#define C1NCH                         248
#define C1NCH1                        249
#define C1NCH2                        250
#define C1PCH                         251
#define C1PCH0                        252
#define C1PCH1                        253
#define C1INTN                        254
#define C1INTP                        255
#define CM2CON0                       256
#define C2SYNC                        257
#define C2HYS                         258
#define C2SP                          259
#define C2POL                         260
#define C2OE                          261
#define C2OUT                         262
#define C2ON                          263
#define CM2CON1                       264
#define C2NCH0                        265
#define C2NCH                         266
#define C2NCH1                        267
#define C2NCH2                        268
#define C2PCH                         269
#define C2PCH0                        270
#define C2PCH1                        271
#define C2INTN                        272
#define C2INTP                        273
#define CMOUT                         274
#define MC1OUT                        275
#define MC2OUT                        276
#define BORCON                        277
#define BORRDY                        278
#define BORFS                         279
#define SBOREN                        280
#define FVRCON                        281
#define ADFVR0                        282
#define ADFVR                         283
#define ADFVR1                        284
#define CDAFVR                        285
#define CDAFVR0                       286
#define CDAFVR1                       287
#define TSRNG                         288
#define TSEN                          289
#define FVRRDY                        290
#define FVREN                         291
#define DACCON0                       292
#define DACPSS                        293
#define DACOE2                        294
#define DACOE1                        295
#define DACEN                         296
#define DACCON1                       297
#define DACR0                         298
#define DACR                          299
#define DACR1                         300
#define DACR2                         301
#define DACR3                         302
#define DACR4                         303
#define APFCON                        304
#define NCO1SEL                       305
#define CLC1SEL                       306
#define T1GSEL                        307
#define SSSEL                         308
#define ANSA0                         309
#define ANSELA                        310
#define ANSA1                         311
#define ANSA2                         312
#define ANSA4                         313
#define ANSELB                        314
#define ANSB4                         315
#define ANSB                          316
#define ANSB5                         317
#define ANSC0                         318
#define ANSELC                        319
#define ANSC1                         320
#define ANSC2                         321
#define ANSC3                         322
#define ANSC6                         323
#define ANSC7                         324
#define PMADRL                        325
#define PMADRH                        326
#define PMDATL                        327
#define PMDATH                        328
#define PMCON1                        329
#define RD                            330
#define WR                            331
#define WREN                          332
#define WRERR                         333
#define FREE                          334
#define LWLO                          335
#define CFGS                          336
#define PMCON2                        337
#define RCREG                         338
#define TXREG                         339
#define SPBRGL                        340
#define SPBRGH                        341
#define RCSTA                         342
#define RX9D                          343
#define OERR                          344
#define FERR                          345
#define ADDEN                         346
#define CREN                          347
#define SREN                          348
#define RX9                           349
#define SPEN                          350
#define TXSTA                         351
#define TX9D                          352
#define TRMT                          353
#define BRGH                          354
#define SENDB                         355
#define SYNC                          356
#define TXEN                          357
#define TX9                           358
#define CSRC                          359
#define BAUDCON                       360
#define ABDEN                         361
#define WUE                           362
#define BRG16                         363
#define SCKP                          364
#define RCIDL                         365
#define ABDOVF                        366
#define WPUA0                         367
#define WPUA                          368
#define WPUA1                         369
#define WPUA2                         370
#define WPUA3                         371
#define WPUA4                         372
#define WPUA5                         373
#define WPUB                          374
#define WPUB4                         375
#define WPUB5                         376
#define WPUB6                         377
#define WPUB7                         378
#define SSP1BUF                       379
#define SSPBUF                        380
#define SSP1ADD                       381
#define ADD                           382
#define SSP1MSK                       383
#define MSK                           384
#define SSP1STAT                      385
#define BF                            386
#define UA                            387
#define R_nW                          388
#define S                             389
#define P                             390
#define D_nA                          391
#define CKE                           392
#define SMP                           393
#define SSP1CON1                      394
#define SSPM0                         395
#define SSPM                          396
#define SSPM1                         397
#define SSPM2                         398
#define SSPM3                         399
#define CKP                           400
#define SSPEN                         401
#define SSPOV                         402
#define WCOL                          403
#define SSP1CON2                      404
#define SEN                           405
#define RSEN                          406
#define PEN                           407
#define RCEN                          408
#define ACKEN                         409
#define ACKDT                         410
#define ACKSTAT                       411
#define GCEN                          412
#define SSP1CON3                      413
#define DHEN                          414
#define AHEN                          415
#define SBCDE                         416
#define SDAHT                         417
#define BOEN                          418
#define SCIE                          419
#define PCIE                          420
#define ACKTIM                        421
#define IOCAP                         422
#define IOCAP0                        423
#define IOCAP1                        424
#define IOCAP2                        425
#define IOCAP3                        426
#define IOCAP4                        427
#define IOCAP5                        428
#define IOCAN0                        429
#define IOCAN                         430
#define IOCAN1                        431
#define IOCAN2                        432
#define IOCAN3                        433
#define IOCAN4                        434
#define IOCAN5                        435
#define IOCAF0                        436
#define IOCAF                         437
#define IOCAF1                        438
#define IOCAF2                        439
#define IOCAF3                        440
#define IOCAF4                        441
#define IOCAF5                        442
#define IOCBP                         443
#define IOCBP4                        444
#define IOCBP5                        445
#define IOCBP6                        446
#define IOCBP7                        447
#define IOCBN4                        448
#define IOCBN                         449
#define IOCBN5                        450
#define IOCBN6                        451
#define IOCBN7                        452
#define IOCBF4                        453
#define IOCBF                         454
#define IOCBF5                        455
#define IOCBF6                        456
#define IOCBF7                        457
#define NCO1ACCL                      458
#define NCO1ACC0                      459
#define NCO1ACC1                      460
#define NCO1ACC2                      461
#define NCO1ACC3                      462
#define NCO1ACC4                      463
#define NCO1ACC5                      464
#define NCO1ACC6                      465
#define NCO1ACC7                      466
#define NCO1ACCH                      467
#define NCO1ACC8                      468
#define NCO1ACC9                      469
#define NCO1ACC10                     470
#define NCO1ACC11                     471
#define NCO1ACC12                     472
#define NCO1ACC13                     473
#define NCO1ACC14                     474
#define NCO1ACC15                     475
#define NCO1ACCU                      476
#define NCO1ACC16                     477
#define NCO1ACC17                     478
#define NCO1ACC18                     479
#define NCO1ACC19                     480
#define NCO1INCL                      481
#define NCO1INC0                      482
#define NCO1INC1                      483
#define NCO1INC2                      484
#define NCO1INC3                      485
#define NCO1INC4                      486
#define NCO1INC5                      487
#define NCO1INC6                      488
#define NCO1INC7                      489
#define NCO1INCH                      490
#define NCO1INC8                      491
#define NCO1INC9                      492
#define NCO1INC10                     493
#define NCO1INC11                     494
#define NCO1INC12                     495
#define NCO1INC13                     496
#define NCO1INC14                     497
#define NCO1INC15                     498
#define NCO1CON                       499
#define N1PFM                         500
#define N1POL                         501
#define N1OUT                         502
#define N1OE                          503
#define N1EN                          504
#define NCO1CLK                       505
#define N1CKS                         506
#define N1CKS0                        507
#define N1CKS1                        508
#define N1PWS0                        509
#define N1PWS                         510
#define N1PWS1                        511
#define N1PWS2                        512
#define PWM1DCL                       513
#define PWM1DCL0                      514
#define PWM1DCL1                      515
#define PWM1DCH                       516
#define PWM1DCH0                      517
#define PWM1DCH1                      518
#define PWM1DCH2                      519
#define PWM1DCH3                      520
#define PWM1DCH4                      521
